# -*- coding: utf-8 -*-

candidates = [
    {'name': '문재인', 'rate': 41.1, 'color': '#004DFF',
     'birth': '1953년 1월 경상남도 거제', 'party': '더불어민주당',
     'pledges':
        ['일자리를 책임지는 대한민국', '국민이 주인인 대한민국', '공정하고 자유로운 대한민국']},
    {'name': '홍준표', 'rate': 24.0, 'color': '#CC0000',
     'birth': '1954년 12월 경상남도 창녕', 'party': '자유한국당',
     'pledges':
        ['강한 안보, 강한 대한민국', '기업에 자유를, 서민에게 기회 제공을 통한 일자리 창출',
         '서민맞춤형 복지 지도 완성으로 복지 사각지대 해소']},
    {'name': '안철수', 'rate': 21.4, 'color': '#036342',
     'birth': '1962년 2월 부산광역시', 'party': '국민의당',
     'pledges':
        ['튼튼한 자강안보를 토대로 한반도 비핵화와 평화체제 구축',
         '교육, 과학기술, 창업혁명으로 경제성장과 미래준비',
         '정경유착 및 불공정거래 근절, 중소상공인 보호로 공정경제 구축']},
    {'name': '유승민', 'rate': 6.8, 'color': '#00D8FF',
     'birth': '1958 1월 대구광역시', 'party': '바른정당',
     'pledges':
        ['아이 키우고 싶은 나라를 만들겠습니다', '일하면서 제대로 대접받는 나라를 만들겠습니다',
         '더불어 사는 공동체 복지를 실현하겠습니다']},
    {'name': '심상정', 'rate': 6.2, 'color': '#FECC0B',
     'birth': '1959년 2월 경기도 파주', 'party': '정의당',
     'pledges':
        ['촛불혁명 완수하는 국민주권형 정치개혁', '튼튼한 안보, 적극적 평화외교로 평화공영시대',
         '조세개혁과 재벌개혁 등 정의로운 경제']}]
